trade_exp/src/InformationRegisters/ПроверкаЦенников/ПроверкаЦенников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="fe415972-e3f8-4f24-9121-8b7bd28f803d">
  <name>ПроверкаЦенников</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources extendedConfigurationObject="1e506e86-174d-4feb-ace1-18ed47c84401">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="09045eb3-7a4b-41ec-a9ec-a7fa6426c086">
    <name>Сотрудник</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="9324264a-018d-4ca8-b8dc-a050686c66b9">
    <name>Проверено</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="286cc05e-d939-448b-a8fc-20d04de6d6e4">
    <name>Просчитано</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <dimensions extendedConfigurationObject="578bd0ba-b0de-432f-a6fc-b1f60a16199a">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="310bb204-549c-4710-859b-280ff8b6a59d">
    <name>Документ</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="76a0a643-f24f-4fef-b619-83ef08b7a4a4">
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/Documents/ПересчетТоваров/ПересчетТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ПересчетТоваров</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>ЯчейкаКонсолидацииИзлишковТоваров</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Помещение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>БлокироватьЯчейки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПечататьКоличествоПоУчету</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИспользоватьОтдельнуюЯчейкуИзлишков</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЯчейкаКонсолидацииИспорченныхТоваров</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИспользоватьОтдельнуюЯчейкуПорчи</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЧленКомиссии1</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЧленКомиссии2</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЧленКомиссии3</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПредседательКомиссии</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВидЦены</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ГоловнойСклад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИсполнительСотрудник</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="040754a8-2dde-4072-bfa3-9c51e0ca7cd2">
    <name>ПодтвержденСкладом</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e632e4d1-fe18-4e14-b8a6-113c60649561">
    <name>ПодтвержденОтделомКачества</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f7c71b25-2abe-41c9-948d-e18b76eb6d67">
    <name>ИсключитьИзКонтроля</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d4fbe761-a1cc-429e-bed1-680526320608">
    <name>Просчитано</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="02012c23-cfa9-4c37-96f6-66f18b1f54c5">
    <name>ТипПересчета</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d4cfb00e-a468-4140-88dd-d9e5d7a096bd">
    <name>ДатаПодтвержденияСкладом</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f2a3a09c-4c4f-4ea5-bc3b-5252b19c4ced">
    <name>ДатаПодтвержденияОтделомКачества</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f1365d65-692e-4312-b3b4-18aeb2a5ca57">
    <name>ДолжностьИсполнитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0c8068b5-e9f5-4b58-912c-433b08083a70">
    <name>ДолжностьСклад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8b5ee26d-88c2-48ad-b701-e631a5e1f49f">
    <name>ОтделСклад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="609a5325-5e4a-4f9e-ab97-19e64b786547">
    <name>ТочкаПересчета</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="cad28ae1-66cb-4891-bfcb-0c8259769d8a">
    <name>РабочийУчасток</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d6a58a7d-0549-442b-ace1-d1785bda675f">
    <name>УчетСкрыт</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f8c7b3b6-6b51-4023-aeaf-d962dc0722a1">
    <name>ВремяНачала</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d36ef11d-27b1-4a3d-b76c-c80a74b649b4">
    <name>ВремяОкончания</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="cf9a4ec4-67f0-49ad-822c-80861431af21">
    <name>НовыйРасчетОтклонения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>КоличествоФакт</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>КоличествоУпаковокФакт</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Назначение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Ячейка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="b8be4401-6630-4e65-8608-174dbf3f7872">
      <name>ИзлишекПорча</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="4cf0abf1-81c0-4ce6-87e3-507388705497">
      <name>СтатусУказанияСерий</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>2</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="b289217d-159a-431e-884f-ee0f6d4cc0c5">
      <name>Комментарий</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="4c6cad3a-61b8-464b-85fb-aadc2599a9fb">
      <name>СчетчикОтображенияВопроса</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="c65a4019-c532-43c3-9971-a0da5c94eb79">
      <name>ЯПХ</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="800cfc6f-b5e5-4c26-afb9-ad1668d2fd42">
      <name>КоличествоПоУчетуВЗонеХранения</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="7fc82a4c-1a25-496c-90c4-267893cbfa85">
      <name>Приход</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="6681f56f-d334-4dc6-8f05-7d7aab3aeffa">
      <name>Расход</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="615d170a-007d-4c17-9f71-ce5bd793a32e">
      <name>СпособВводаКоличестваТовара</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="e9b280c2-3352-461f-8333-98ea82ff1b60">
      <name>Отсканирован</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

trade_exp/src/InformationRegisters/ПроверкаЦенников/ManagerModule.bsl
&НаСервере
Процедура ЗаписьВРегистре(Документ) Экспорт
	УстановитьПривилегированныйРежим(Истина); 
	Запрос = Новый Запрос;
	ЗапросТекст = ПолучитьЗапрос(Документ);   
	
	Если не ЗапросТекст = Неопределено Тогда 
	 	
		Запрос.Текст = ЗапросТекст;  
		Запрос.УстановитьПараметр("Документ", Документ);
		
		Результат = Запрос.Выполнить(); 
		
		Выборка = Результат.Выбрать(); 
		
		ПроверкаЦенников = РегистрыСведений.ПроверкаЦенников;
		НаборЗапись = ПроверкаЦенников.СоздатьНаборЗаписей();
			 
		НаборЗапись.Отбор.Документ.Установить(Документ);
		НаборЗапись.Прочитать();
	    НаборЗапись.Очистить();
		
		Пока Выборка.Следующий() Цикл
			Запись = НаборЗапись.Добавить();
			Запись.Период = Документ.Дата;
			Запись.Документ = Документ;
			Запись.Номенклатура = Выборка.Номенклатура; 
			Запись.Характеристика = Выборка.Характеристика;
			Запись.Склад = Выборка.Склад;  
			Запись.Сотрудник = Выборка.Сотрудник; 
			Запись.Проверено = Выборка.Проверено;
			Запись.Просчитано = Выборка.Просчитано; 
			Запись.ЦенникиПроверены = Выборка.ЦенникиПроверены;  
		КонецЦикла;
		НаборЗапись.Записать(); 
	КонецЕсли;
	УстановитьПривилегированныйРежим(Ложь); 


КонецПроцедуры

&НаСервере
Функция ПолучитьЗапрос(документ) 
	
	Если ТипЗнч(документ) = Тип("ДокументСсылка.ПересчетТоваров") Тогда
		ТекстЗапроса = "ВЫБРАТЬ Различные
						|	ПересчетТоваровТовары.Номенклатура КАК Номенклатура,
						|	ПересчетТоваровТовары.Характеристика КАК Характеристика,
						|	ПересчетТоваров.Склад КАК Склад,
						|	ПересчетТоваров.Ответственный КАК Сотрудник,
						|	1 КАК Просчитано,
						|	0 КАК Проверено,
						|	0 КАК ЦенникиПроверены
						|ИЗ
						|	Документ.ПересчетТоваров.Товары КАК ПересчетТоваровТовары
						|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПересчетТоваров КАК ПересчетТоваров
						|		ПО (ПересчетТоваровТовары.Ссылка = ПересчетТоваров.Ссылка)
						|ГДЕ
						|	ПересчетТоваров.Ссылка = &Документ";
	ИначеЕсли ТипЗнч(документ) = Тип("ДокументСсылка.ПроверкаЦенников")
			  И Документ.ВидПроверки = Перечисления.ВидПроверкиЦенников.ПоПлану Тогда 
		ТекстЗапроса = "ВЫБРАТЬ Различные
		               |	ПроверкаЦенниковТовары.Номенклатура КАК Номенклатура,
		               |	NULL КАК Характеристика,
		               |	ПроверкаЦенников.Склад КАК Склад,
		               |	ПроверкаЦенников.Ответственный КАК Сотрудник,
		               |	1 КАК Проверено,
		               |	0 КАК Просчитано,
					   |	0 КАК ЦенникиПроверены
		               |ИЗ
		               |	Документ.ПроверкаЦенников.Товары КАК ПроверкаЦенниковТовары
		               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПроверкаЦенников КАК ПроверкаЦенников
		               |		ПО ПроверкаЦенниковТовары.Ссылка = ПроверкаЦенников.Ссылка
		               |ГДЕ
		               |	ПроверкаЦенников.Ссылка = &Документ
		               |	И (ПроверкаЦенниковТовары.Проверено = ИСТИНА)";
	ИначеЕсли ТипЗнч(документ) = Тип("ДокументСсылка.ПроверкаЦенников")
			  И Документ.ВидПроверки = Перечисления.ВидПроверкиЦенников.ПоПереоценке Тогда 
		ТекстЗапроса = "ВЫБРАТЬ Различные
		               |	ПроверкаЦенниковТовары.Номенклатура КАК Номенклатура,
		               |	NULL КАК Характеристика,
		               |	ПроверкаЦенников.Склад КАК Склад,
		               |	ПроверкаЦенников.Ответственный КАК Сотрудник,
		               |	0 КАК Проверено,
		               |	0 КАК Просчитано,
					   |	1 КАК ЦенникиПроверены
		               |ИЗ
		               |	Документ.ПроверкаЦенников.Товары КАК ПроверкаЦенниковТовары
		               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПроверкаЦенников КАК ПроверкаЦенников
		               |		ПО ПроверкаЦенниковТовары.Ссылка = ПроверкаЦенников.Ссылка
		               |ГДЕ
		               |	ПроверкаЦенников.Ссылка = &Документ
		               |	И (ПроверкаЦенниковТовары.Проверено = ИСТИНА)";
	Иначе 
		ТекстЗапроса = Неопределено; 
	КонецЕсли; 
	Возврат ТекстЗапроса; 

	
КонецФункции
